# ГЛАВА 5. Арифметические выражения. Модуль math.
from math import sin, cos
# 5.1. Записать по правилам изучаемого языка программирования следующие выражения (все формулы должны вычисляться): abs()
x = 126
y = 224
a = 82
b = 344
c = 675
m = 3
n = 2

alpha = 1.5708
beta = 1.047

print('Задача 5.1')
print(2 * x)
print(sin(x))
print(a ** 2)
print(x ** 1/2)
print(abs(n))
print(5 * cos(y))
print(-7.5 * a ** 2)
print(3 * x ** 1/2)
print(sin(alpha) * cos(beta) + cos(alpha) * sin(beta))
print(a * ((2 * b) ** 1/2))
print(3 * sin(2 * alpha) * cos(3 * beta))
print(-5 * ((x + (y ** 1/2)) ** 1/2))
print()

# 5.2. Получить линейную запись следующих выражений (все формулы должна вычисляться):
print('Задача 5.2')

print(-1 / x ** 2)
print(a / b * c)
print(a / b * c)
print((a + b) / 2)
print(5.45 * (a + 2 * b) / (2 - a))
print((-b + (b * 2 - 4 * a * c) ** 1/2) / 2 * a)
print((-b + 1 / a) / (2 / c))
print(1 / ( 1 + ((a + b) / 2)))
print(1 / (1 + (1 / (2 + (1 / (2 + (3 / 5)))))))
print(2 ** (m ** n))
print()

# 5.3. Записать по правилам изучаемого языка программирования следующие выражения (все формулы должны вычисляться):
print('Задача 5.3')
x = 3
x_1 = 5
x_2 = 6
x_3 = 2

print((x_1 ** 2 + x_2 ** 2) ** 1/2)
print(x_1 * x_2 + x_1 * x_3 + x_2 * x_3)

v = 2
t = 4
a = 3
print(v * t + ((a * t ** 2) / 2))

m = 4
g = 2
h = 5
print(((m * v ** 2) / 2) + m * g * h)

R_1 = 2
R_2 = 3
print((1 / R_1) + (1 / R_2))

print(m * g * cos(alpha))

R = 14
pi = 3.14
I = 23
print(2 * pi * R)

print(b ** 2 - 4 * a * c)
print(I ** 2 * R)

a = 8
b = 4
c = 5
d = 7
x = 3
print(a * b * sin(c))
print((a ** 2 + b ** 2 - 2 * a * b * cos(c)) ** 1/2)
print((a * d + b * c) / (a * d))
print((1 - sin(x) ** 2) ** 1/2)
print(1 / ((a * x ** 2 + b * x + c) ** 1/2))
print(((x + 1) ** 1/2 + (x - 1) ** 1/2) * 2 * x ** 1/2)
print(abs(x) + abs(x + 1))
print(abs(1 - abs(x)))

print()

# 5.4. Составить программу вычисления значения функции при любом значении а. 
print('Задача 5.4')
a = 45
y = (a ** 2 + 10) / ((a ** 2 + 1) ** 1/2 )
print(y)
print()

# 5.5. Составить программу: 
# а) вычисления значения функции при любом значении а; 
# б) вычисления значения функции при любом значении х. 
print('Задача 5.5')
a = 65
x = ((2 * a + sin(abs(3 * a))) / 3.56) ** 1/2
print(x)
print()

x = 21
y = sin((3.2 + (1 + x) ** 1/2) / abs(5 * x))
print(y)
print()

# 5.6. Составить программу вычисления значений функций при любых значениях х и y. 
print('Задача 5.6')
x = 42
y = 55
z = (x + ((2 + y) / x ** 2)) / (y + (1 / (x ** 2 + 10) ** 1/2))
q = 2.8 * sin(x + abs(y))
print(z)
print(q)
print()

# 5.7. Составить программу расчета значения функций при любых значениях a и b.
print('Задача 5.7')
a = 7
b = 21
x = (((2 / (a ** 2 + 25)) + b) / (b ** 1/2 + (a + b) / 2))
y = (abs(a) + 2 * sin(b)) / 5.5 * a
print(x)
print(y)
print()

# 5.8. Составить программу расчета значения функций при любых значениях e, f, g и h.
print('Задача 5.8')
e = 2
f = 67
g = 4
h = 9
a = (abs(e - 3 / f) ** 3 + g) ** 1/2
b = sin(e) + cos(h) ** 2
c = (33 * g) / (e * f - 3)
print(a)
print(b)
print(c)
print()

# 5.9. Составить программу расчета значения функций при любых значениях e, f, g и h.
print('Задача 5.9')
e = 5
f = 12
g = 6
h = 2
a = (e + f / 2) / 3
b = abs(h ** 2 - g)
c = ((g - h) ** 2 - 3 * sin(e)) ** 1/2
print(a)
print(b)
print(c)
print()
