# ГЛАВА 5. Арифметические выражения. Модуль math.
from math import sin, cos
# 5.1. Записать по правилам изучаемого языка программирования следующие выражения (все формулы должны вычисляться): abs()
x = 126
y = 224
a = 82
b = 344
c = 675
m = 3
n = 2

alpha = 1.5708
beta = 1.047

print('Задача 5.1')
print(2 * x)
print(sin(x))
print(a ** 2)
print(x ** 1/2)
print(abs(n))
print(5 * cos(y))
print(-7.5 * a ** 2)
print(3 * x ** 1/2)
print(sin(alpha) * cos(beta) + cos(alpha) * sin(beta))
print(a * ((2 * b) ** 1/2))
print(3 * sin(2 * alpha) * cos(3 * beta))
print(-5 * ((x + (y ** 1/2)) ** 1/2))
print()

# 5.2. Получить линейную запись следующих выражений (все формулы должна вычисляться):
print('Задача 5.2')

print(-1 / x ** 2)
print(a / b * c)
print(a / b * c)
print((a + b) / 2)
print(5.45 * (a + 2 * b) / (2 - a))
print((-b + (b * 2 - 4 * a * c) ** 1/2) / 2 * a)
print((-b + 1 / a) / (2 / c))
print(1 / ( 1 + ((a + b) / 2)))
print(1 / (1 + (1 / (2 + (1 / (2 + (3 / 5)))))))
print(2 ** (m ** n))
print()

# 5.3. Записать по правилам изучаемого языка программирования следующие выражения (все формулы должны вычисляться):

print(f"{}")


# 5.4. Составить программу вычисления значения функции при любом значении а. 


# 5.5. Составить программу: 
# а) вычисления значения функции при любом значении а; 
# б) вычисления значения функции при любом значении х. 


# 5.6. Составить программу вычисления значений функций при любых значениях х и y. 


# 5.7. Составить программу расчета значения функций при любых значениях a и b.


# 5.8. Составить программу расчета значения функций при любых значениях e, f, g и h.


# 5.9. Составить программу расчета значения функций при любых значениях e, f, g и h.
